package ByMyself.A_Java_B_Book;

public class Doit_10_interface {

    public static void main(String[] args) {


//        1. 인터페이스란?
//        1) 구현코드가 없는 인터페이스
//           - 인터페이스는 클래스 혹은 프로그램이 제공하는 기능을 명시적으로 선언하는 역할을 합니다. 인터페이스는 추성 메서드와
//             상수로만 이루어져 있습니다. 구현된 코드가 없기 때문에 당연히 인터페이스로 인스턴스를 생성할 수도 없습니다.
//           - 인터페이스의 메서드는 추상 메서드로, 변수는 모두 값이 변하지 않는 상수로 컴파일 과정에서 자동 변환
//        2) 클래스에서 인터페이스 구현하기

//        2. 인터페이스와 다형성

//        3. 인터페이스 요소 살펴보기
//        1) 인터페이스 상수
//        2) 디폴트 메서드와 정적 메서드
//           - 디폴트 메서드 : 인터페이스에서 구현 코드까지 작성한 메서드
//           - 정적 메서드 : statci예약어를 사용하여 선언하며 클래스 생성과 무관하게 사용 가능
//        3) private 메서드

//        4. 인터페이스 활용하기









    }

}
